{
  "2403.12051v2": {
    "title": "Terrestrial Life in Light of the Copernican Principle",
    "authors": [
      "Ian von Hegner"
    ],
    "summary": "Although many solar systems have been discovered, only one example of life is\nknown. Thus, terrestrial life represents merely one data point. Consequently,\nextrapolating from terrestrial life to life elsewhere in the galaxy and beyond\nis often seen as a limitation in the search for different forms of life.\nEssentially, attempting to extrapolate from terrestrial life to life elsewhere\nimplies that terrestrial life is representative of all life, reflecting a\ngeocentric viewpoint. However, in accordance with the Copernican principle, the\nopposite holds true. Asserting that terrestrial life must differ from other\nforms of life in the universe is, in fact, the geocentric viewpoint. For if\nlife elsewhere is not like terrestrial life, then it is ipso facto different\nlife; more precisely, if terrestrial life does not represent general life, then\nthat life must represent special life, which the principle states it is not.\nThis study employs the Copernican principle as a probability assessment,\naddressing critiques rooted in the implicit assumption of the existence of\ndifferent extraterrestrial forms of life. If various fundamental forms of life\nindeed exist, then differences in the probabilities of their emergence can be\nexpected, forming a probability scale. This holds significance because it not\nonly allows for insights into the characteristics of the majority of life\nelsewhere but also facilitates the establishment of boundaries for categories\nof life as we do not know it. Thus, the Copernican-Darwinian principle provides\na valuable tool for astrobiology and the search for life in the galaxy and\nbeyond.",
    "pdf_url": "http://arxiv.org/pdf/2403.12051v2",
    "published": "2023-12-30"
  },
  "2310.06274v1": {
    "title": "Life cycle insurance, bequest motives and annuity loads",
    "authors": [
      "Aleksandar Arandjelović",
      "Geoffrey Kingston",
      "Pavel V. Shevchenko"
    ],
    "summary": "We investigate insurance purchases when bequest motives are age-varying and\nlife insurance and life annuities both carry loads. The existing life cycle\nliterature assumes bequests are normal goods without being either necessities\nor luxuries. Much of the literature also assumes implicitly that life annuity\nloads are negative. A key finding of the literature is that the demand for life\ninsurance and the demand for life annuities are symmetrical. It is optimal to\nbuy life-contingent insurance throughout life, even under loads. A life annuity\nphase backs directly onto a life insurance phase. We find that realistic\nexamples with positive loads on both products reveal up to two distinct periods\nof non-participation, one in midlife and the other adjoining the maximum age.\nWe highlight examples with necessity bequests during child-rearing years and\nluxury bequests thereafter. This set of assumptions explains why a substantial\ndemand for life insurance during child-rearing years can co-exist with\nnegligible demand for life annuities later on. A realistic 18% load on both\nproducts generates this outcome.",
    "pdf_url": "http://arxiv.org/pdf/2310.06274v1",
    "published": "2023-10-10"
  },
  "1111.6345v1": {
    "title": "Modelling comonotonic group-life under dependent decrement causes",
    "authors": [
      "Dabuxilatu Wang"
    ],
    "summary": "Comonotonicity had been a extreme case of dependency between random\nvariables. This article consider an extension of single life model under\nmultiple dependent decrement causes to the case of comonotonic group-life.",
    "pdf_url": "http://arxiv.org/pdf/1111.6345v1",
    "published": "2011-11-28"
  },
  "2304.08327v1": {
    "title": "LED: A Dataset for Life Event Extraction from Dialogs",
    "authors": [
      "Yi-Pei Chen",
      "An-Zi Yen",
      "Hen-Hsen Huang",
      "Hideki Nakayama",
      "Hsin-Hsi Chen"
    ],
    "summary": "Lifelogging has gained more attention due to its wide applications, such as\npersonalized recommendations or memory assistance. The issues of collecting and\nextracting personal life events have emerged. People often share their life\nexperiences with others through conversations. However, extracting life events\nfrom conversations is rarely explored. In this paper, we present Life Event\nDialog, a dataset containing fine-grained life event annotations on\nconversational data. In addition, we initiate a novel conversational life event\nextraction task and differentiate the task from the public event extraction or\nthe life event extraction from other sources like microblogs. We explore three\ninformation extraction (IE) frameworks to address the conversational life event\nextraction task: OpenIE, relation extraction, and event extraction. A\ncomprehensive empirical analysis of the three baselines is established. The\nresults suggest that the current event extraction model still struggles with\nextracting life events from human daily conversations. Our proposed life event\ndialog dataset and in-depth analysis of IE frameworks will facilitate future\nresearch on life event extraction from conversations.",
    "pdf_url": "http://arxiv.org/pdf/2304.08327v1",
    "published": "2023-04-17"
  },
  "2207.00634v1": {
    "title": "False positives and the challenge of testing the alien hypothesis",
    "authors": [
      "Searra Foote",
      "Pritvik Sinhadc",
      "Cole Mathis",
      "Sara Imari Walker"
    ],
    "summary": "The origin of life and the detection of alien life have historically been\ntreated as separate scientific research problems. However, they are not\nstrictly independent. Here, we discuss the need for a better integration of the\nsciences of life detection and origins of life. Framing these dual problems\nwithin the formalism of Bayesian hypothesis testing, we show via simple\nexamples how high confidence in life detection claims require either (1) a\nstrong prior hypothesis about the existence of life in a particular alien\nenvironment, or conversely, (2) signatures of life that are not susceptible to\nfalse positives. As a case study, we discuss the role of priors and hypothesis\ntesting in recent results reporting potential detection of life in the Venusian\natmosphere and in the icy plumes of Enceladus. While many current leading\nbiosignature candidates are subject to false positives because they are not\ndefinitive of life, our analyses demonstrate why it is necessary to shift focus\nto candidate signatures that are definitive. This indicates a necessity to\ndevelop methods that lack false positives, by using observables for life that\nrely on prior hypotheses with strong theoretical and empirical support in\nidentifying defining features of life. Abstract theories developed in pursuit\nof understanding universal features of life are more likely to be definitive\nand to apply to life-as-we-don't-know-it. In the absence of alien examples\nthese are best validated in origin of life experiments, substantiating the need\nfor better integration between origins of life and biosignature science\nresearch communities.",
    "pdf_url": "http://arxiv.org/pdf/2207.00634v1",
    "published": "2022-07-01"
  }
}