{
  "2205.07616v1": {
    "title": "The logic of planetary combination in Vettius Valens",
    "authors": [
      "Claire Hall",
      "Liam P. Shaw"
    ],
    "summary": "The Anthologies of the second-century astrologer Vettius Valens (120-c.175\nCE) is the most extensive surviving practical astrological text from the\nperiod. Despite this, the theoretical underpinnings of the Anthologies have\nbeen understudied; in general, the work has been overshadowed by Ptolemy's\ncontemporaneous Tetrabiblos. While the Tetrabiblos explicitly aims to present a\nsystematic account of astrology, Valens' work is often characterised as a\nmiscellaneous collection, of interest to historians only for the evidence it\npreserves about the practical methods used in casting horoscopes. In this\narticle, we argue that the Anthologies is also an invaluable resource for\nengagement with the conceptual basis of astrology. As a case study, we take a\nsection of Anthologies Book 1 which lists the possible astrological effects of\nplanets, both alone and in 'combinations' of two and three. We demonstrate that\nanalysing Valens' descriptions quantitatively with textual analysis reveals a\nconsistent internal logic of planetary combination. By classifying descriptive\nterms as positive or negative, we show that the resulting 'sentiment' of\nplanetary combinations is well-correlated with their component parts.\nFurthermore, we find that the sentiment of three-planet combinations is more\nstrongly correlated with the average sentiment of their three possible\ncomponent pairs than with the average sentiment of individual planets,\nsuggesting an iterative combinatorial logic. Recognition of this feature of\nastrological practice has been neglected compared to the mathematical methods\nfor calculating horoscopes. We argue that this analysis not only provides\nevidence that the astrological lore detailed in Valens is more consistent than\nis often assumed, but is also indicative of a wider methodological technique in\npractical astrology: combinatorial reasoning from existing astrological lore.",
    "pdf_url": "http://arxiv.org/pdf/2205.07616v1",
    "published": "2022-05-16"
  },
  "1108.5506v1": {
    "title": "Warum Astrologie nicht funktionieren kann",
    "authors": [
      "Florian Freistetter"
    ],
    "summary": "There exists many different versions of astrology that are different from\neach other and sometimes even in conflict with each other. But the basis of\nevery astrological system is the assumption of a connection between the motion\nof celestial bodies and the fate of man. An analysis of the methods of\nastrology shows that - regardless of which special system is used - there\nexists no consistent basis that allows to deduce general and verifiable rules.\nAn astrological analysis is therefore always arbitrary and meaningless.\nAstrology does not work.\n  -----\n  Astrologie existiert in vielen verschiedenen Versionen die sich oft deutliche\nvoneinander unterscheiden und sogar widersprechen. Allen gemeinsam ist aber die\ngrundlegende Annahme eines Zusammenhangs zwischen der Bewegung der\nHimmelsk\\\"orper und dem Schicksal der Menschen. Eine Analyse der astrologischen\nMethodik zeigt, dass sie - egal in welcher konkreten Auspr\\\"agung - \\\"uber\nkeine in sich schl\\\"ussige Grundlage verf\\\"ugt, anhand der sich\nallgemeing\\\"ultige und \\\"uberpr\\\"ufbare Regeln f\\\"ur die astrologische Arbeit\nableiten lassen. Die astrologische Deutung bleibt somit beliebig. Astrologie\nfunktioniert nicht.",
    "pdf_url": "http://arxiv.org/pdf/1108.5506v1",
    "published": "2011-08-28"
  },
  "0808.3541v1": {
    "title": "Dante, astrology and astronomy",
    "authors": [
      "Alejandro Gangui"
    ],
    "summary": "Some verses of Dante Alighieri suggest his astrological sign and his probable\ndate of birth. This leads us to reflect on the different methods, increasingly\ndivergent, with which sciences as opposed to beliefs approach reality.",
    "pdf_url": "http://arxiv.org/pdf/0808.3541v1",
    "published": "2008-08-26"
  },
  "0712.1443v1": {
    "title": "The Jagiellonians and the Stars",
    "authors": [
      "K. Baczek",
      "B. Wszolek"
    ],
    "summary": "The largest centre for astronomical and astrological study in the fifteenth\ncentury was the University of Cracow, which always was under special care of\nJagiellonians. The use of astronomy and astrology at Jagiellonian courts in the\nfifteenth and sixteenth centuries were very common. We try to convince the\nreader about this, exposing very limited historical sources.",
    "pdf_url": "http://arxiv.org/pdf/0712.1443v1",
    "published": "2007-12-10"
  },
  "1006.5209v2": {
    "title": "\"Astronomy\" or \"astrology\": a brief history of an apparent confusion",
    "authors": [
      "A. Losev"
    ],
    "summary": "The modern usage of the words astronomy and astrology is traced back to\ndistinctions, largely ignored in recent scholarship. Three interpretations of\ncelestial phenomena (in a geometric, a substantialist and a prognostic\nversions) coexisted during the Hellenistic period. From Plato to Isidore of\nSeville, semantic changes are evidenced and their later development is\nsketched.",
    "pdf_url": "http://arxiv.org/pdf/1006.5209v2",
    "published": "2010-06-27"
  }
}